ruby/O.org
#+TITLE:     O
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>



* [[https://wordsinasentence.com/obdurate-in-a-sentence/][Obdurate]]

  =unmoved by persuasion, pity, or tender feelings; stubborn=

  - With his obdurate personality and intense dislike for people, Jonathan had all the makings of a professional killer.
  - Sometimes, you are too obdurate for your own good!
  - Despite the defendant’s apology, the judge was obdurate and gave him a thirty-year sentence.
  - Because Janice was obdurate, she did not shed a single tear while hearing the tragic story.
  - Even though his fellow teammates urged him to accept the new coach, the star basketball player remained obdurate and refused to follow the coach’s directions.
  - The protestors were obdurate and did not move even when the police arrived.
  - Will you stop being so obdurate and at least listen to my point of view?


* [[https://wordsinasentence.com/obfuscate-in-a-sentence/][Obfuscate]]

  =to deliberately make something confusing or difficult to understand=

  - The loan contract was filled with legal words meant to obfuscate trusting borrowers.
  - Because I am a sympathetic teacher, I avoid using language which will obfuscate my students.
  - Surprisingly, the efforts of the translator only served to obfuscate an already confusing conversation.
  - The last thing I want to do is obfuscate the concept by trying to explain it too rapidly.
  - If you will obfuscate the store clerk with some crazy questions, I will steal the candy.
  - The con man hoped to obfuscate the elderly woman by using large words to describe his investment plan.
  - Because I am honest, I never try to obfuscate my true intentions!

* [[https://wordsinasentence.com/obligate-in-a-sentence/][Obligate]]

  =to be required or forced=

  - All citizens of the United States must obligate to vote in every election as their civic duty.
  - Witnesses of the crime will obligate to stand before the court and state what they saw at the scene in order for the criminal to be found guilty.
  - After years of the same Christmas customs, my family members obligate to buy presents at least for all of the children in the family.
  - All banks obligate people to repay their loans or take the chance of their credit being ruined.

* [[https://wordsinasentence.com/obligatory-in-a-sentence/][Obligatory]]

  =required by law or a set of rules=

  - As part of my obligatory court sentence, I must complete sixty hours of community service.
  - New hires must attend the obligatory orientation session.
  - Because Ray is an awesome host, he never fails to perform the obligatory duties like greeting each guest and keeping glasses full.
  - Every cheesy spy movie has the obligatory fight scene that lasts at least fifteen minutes.

