ruby/O.html
<!DOCTYPE html>
<html>
<head>
<title>O</title>
<!-- 2018-06-04 Mon 23:24 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">O</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Obdurate</a></li>
<li><a href="#sec-2">2. Obfuscate</a></li>
<li><a href="#sec-3">3. Obligate</a></li>
<li><a href="#sec-4">4. Obligatory</a></li>
<li><a href="#sec-5">5. Oblige</a></li>
<li><a href="#sec-6">6. Obliging</a></li>
<li><a href="#sec-7">7. Obliterate</a></li>
<li><a href="#sec-8">8. Oblivious</a></li>
<li><a href="#sec-9">9. Obsequious</a></li>
<li><a href="#sec-10">10. Obsolescence</a></li>
<li><a href="#sec-11">11. Obstinacy</a></li>
<li><a href="#sec-12">12. Obstinate</a></li>
<li><a href="#sec-13">13. Obviate</a></li>
<li><a href="#sec-14">14. Odious</a></li>
<li><a href="#sec-15">15. Offhand</a></li>
<li><a href="#sec-16">16. Oligarchy</a></li>
<li><a href="#sec-17">17. Ominous</a></li>
<li><a href="#sec-18">18. Onerous</a></li>
<li><a href="#sec-19">19. Opalescent</a></li>
<li><a href="#sec-20">20. Operative</a></li>
<li><a href="#sec-21">21. Opinionated</a></li>
<li><a href="#sec-22">22. Opportune</a></li>
<li><a href="#sec-23">23. Oppressive</a></li>
<li><a href="#sec-24">24. Opprobrious</a></li>
<li><a href="#sec-25">25. Optimism</a></li>
<li><a href="#sec-26">26. Opulent</a></li>
<li><a href="#sec-27">27. Ordeal</a></li>
<li><a href="#sec-28">28. Ossify</a></li>
<li><a href="#sec-29">29. Ostentatious</a></li>
<li><a href="#sec-30">30. Ostracize</a></li>
<li><a href="#sec-31">31. Oust</a></li>
<li><a href="#sec-32">32. Outgoing</a></li>
<li><a href="#sec-33">33. Outstrip</a></li>
<li><a href="#sec-34">34. Overbearing</a></li>
<li><a href="#sec-35">35. Overcast</a></li>
<li><a href="#sec-36">36. Overdue</a></li>
<li><a href="#sec-37">37. Override</a></li>
<li><a href="#sec-38">38. Overt</a></li>
<li><a href="#sec-39">39. Overwrought</a></li>
<li><a href="#sec-40">40. Oath</a></li>
<li><a href="#sec-41">41. Obeisance</a></li>
<li><a href="#sec-42">42. Objection</a></li>
<li><a href="#sec-43">43. Oblige</a></li>
<li><a href="#sec-44">44. Oblique</a></li>
<li><a href="#sec-45">45. Obloquy</a></li>
<li><a href="#sec-46">46. Obnoxious</a></li>
<li><a href="#sec-47">47. Observance</a></li>
<li><a href="#sec-48">48. Obsolete</a></li>
<li><a href="#sec-49">49. Obstinate</a></li>
<li><a href="#sec-50">50. Obstreperous</a></li>
<li><a href="#sec-51">51. Obtrude</a></li>
<li><a href="#sec-52">52. Obtuse</a></li>
<li><a href="#sec-53">53. Obverse</a></li>
<li><a href="#sec-54">54. Occlude</a></li>
<li><a href="#sec-55">55. Occult</a></li>
<li><a href="#sec-56">56. Ocular</a></li>
<li><a href="#sec-57">57. Ode</a></li>
<li><a href="#sec-58">58. Odium</a></li>
<li><a href="#sec-59">59. Odoriferous</a></li>
<li><a href="#sec-60">60. Ogle</a></li>
<li><a href="#sec-61">61. Ointment</a></li>
<li><a href="#sec-62">62. Oleaginous</a></li>
<li><a href="#sec-63">63. Olfactory</a></li>
<li><a href="#sec-64">64. Omnipresent</a></li>
<li><a href="#sec-65">65. Omniscient</a></li>
<li><a href="#sec-66">66. Omnivorous</a></li>
<li><a href="#sec-67">67. Onset</a></li>
<li><a href="#sec-68">68. Onslaught</a></li>
<li><a href="#sec-69">69. Onus</a></li>
<li><a href="#sec-70">70. Ooze</a></li>
<li><a href="#sec-71">71. Opine</a></li>
<li><a href="#sec-72">72. Oracular</a></li>
<li><a href="#sec-73">73. Orator</a></li>
<li><a href="#sec-74">74. Ordain</a></li>
<li><a href="#sec-75">75. Ordinance</a></li>
<li><a href="#sec-76">76. Ornate</a></li>
<li><a href="#sec-77">77. Ornery</a></li>
<li><a href="#sec-78">78. Orotund</a></li>
<li><a href="#sec-79">79. Oscillate</a></li>
<li><a href="#sec-80">80. Osmosis</a></li>
<li><a href="#sec-81">81. Ostensible</a></li>
<li><a href="#sec-82">82. Otiose</a></li>
<li><a href="#sec-83">83. Outfox</a></li>
<li><a href="#sec-84">84. Outlandish</a></li>
<li><a href="#sec-85">85. Outset</a></li>
<li><a href="#sec-86">86. Overhaul</a></li>
<li><a href="#sec-87">87. Overture</a></li>
<li><a href="#sec-88">88. Overweening</a></li>
<li><a href="#sec-89">89. Oxidize</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Obdurate</a></li>
<li><a href="#sec-2">2. Obfuscate</a></li>
<li><a href="#sec-3">3. Obligate</a></li>
<li><a href="#sec-4">4. Obligatory</a></li>
<li><a href="#sec-5">5. Oblige</a></li>
<li><a href="#sec-6">6. Obliging</a></li>
<li><a href="#sec-7">7. Obliterate</a></li>
<li><a href="#sec-8">8. Oblivious</a></li>
<li><a href="#sec-9">9. Obsequious</a></li>
<li><a href="#sec-10">10. Obsolescence</a></li>
<li><a href="#sec-11">11. Obstinacy</a></li>
<li><a href="#sec-12">12. Obstinate</a></li>
<li><a href="#sec-13">13. Obviate</a></li>
<li><a href="#sec-14">14. Odious</a></li>
<li><a href="#sec-15">15. Offhand</a></li>
<li><a href="#sec-16">16. Oligarchy</a></li>
<li><a href="#sec-17">17. Ominous</a></li>
<li><a href="#sec-18">18. Onerous</a></li>
<li><a href="#sec-19">19. Opalescent</a></li>
<li><a href="#sec-20">20. Operative</a></li>
<li><a href="#sec-21">21. Opinionated</a></li>
<li><a href="#sec-22">22. Opportune</a></li>
<li><a href="#sec-23">23. Oppressive</a></li>
<li><a href="#sec-24">24. Opprobrious</a></li>
<li><a href="#sec-25">25. Optimism</a></li>
<li><a href="#sec-26">26. Opulent</a></li>
<li><a href="#sec-27">27. Ordeal</a></li>
<li><a href="#sec-28">28. Ossify</a></li>
<li><a href="#sec-29">29. Ostentatious</a></li>
<li><a href="#sec-30">30. Ostracize</a></li>
<li><a href="#sec-31">31. Oust</a></li>
<li><a href="#sec-32">32. Outgoing</a></li>
<li><a href="#sec-33">33. Outstrip</a></li>
<li><a href="#sec-34">34. Overbearing</a></li>
<li><a href="#sec-35">35. Overcast</a></li>
<li><a href="#sec-36">36. Overdue</a></li>
<li><a href="#sec-37">37. Override</a></li>
<li><a href="#sec-38">38. Overt</a></li>
<li><a href="#sec-39">39. Overwrought</a></li>
<li><a href="#sec-40">40. Oath</a></li>
<li><a href="#sec-41">41. Obeisance</a></li>
<li><a href="#sec-42">42. Objection</a></li>
<li><a href="#sec-43">43. Oblige</a></li>
<li><a href="#sec-44">44. Oblique</a></li>
<li><a href="#sec-45">45. Obloquy</a></li>
<li><a href="#sec-46">46. Obnoxious</a></li>
<li><a href="#sec-47">47. Observance</a></li>
<li><a href="#sec-48">48. Obsolete</a></li>
<li><a href="#sec-49">49. Obstinate</a></li>
<li><a href="#sec-50">50. Obstreperous</a></li>
<li><a href="#sec-51">51. Obtrude</a></li>
<li><a href="#sec-52">52. Obtuse</a></li>
<li><a href="#sec-53">53. Obverse</a></li>
<li><a href="#sec-54">54. Occlude</a></li>
<li><a href="#sec-55">55. Occult</a></li>
<li><a href="#sec-56">56. Ocular</a></li>
<li><a href="#sec-57">57. Ode</a></li>
<li><a href="#sec-58">58. Odium</a></li>
<li><a href="#sec-59">59. Odoriferous</a></li>
<li><a href="#sec-60">60. Ogle</a></li>
<li><a href="#sec-61">61. Ointment</a></li>
<li><a href="#sec-62">62. Oleaginous</a></li>
<li><a href="#sec-63">63. Olfactory</a></li>
<li><a href="#sec-64">64. Omnipresent</a></li>
<li><a href="#sec-65">65. Omniscient</a></li>
<li><a href="#sec-66">66. Omnivorous</a></li>
<li><a href="#sec-67">67. Onset</a></li>
<li><a href="#sec-68">68. Onslaught</a></li>
<li><a href="#sec-69">69. Onus</a></li>
<li><a href="#sec-70">70. Ooze</a></li>
<li><a href="#sec-71">71. Opine</a></li>
<li><a href="#sec-72">72. Oracular</a></li>
<li><a href="#sec-73">73. Orator</a></li>
<li><a href="#sec-74">74. Ordain</a></li>
<li><a href="#sec-75">75. Ordinance</a></li>
<li><a href="#sec-76">76. Ornate</a></li>
<li><a href="#sec-77">77. Ornery</a></li>
<li><a href="#sec-78">78. Orotund</a></li>
<li><a href="#sec-79">79. Oscillate</a></li>
<li><a href="#sec-80">80. Osmosis</a></li>
<li><a href="#sec-81">81. Ostensible</a></li>
<li><a href="#sec-82">82. Otiose</a></li>
<li><a href="#sec-83">83. Outfox</a></li>
<li><a href="#sec-84">84. Outlandish</a></li>
<li><a href="#sec-85">85. Outset</a></li>
<li><a href="#sec-86">86. Overhaul</a></li>
<li><a href="#sec-87">87. Overture</a></li>
<li><a href="#sec-88">88. Overweening</a></li>
<li><a href="#sec-89">89. Oxidize</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-06-04 23:24:47</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/obdurate-in-a-sentence/">Obdurate</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>unmoved by persuasion, pity, or tender feelings; stubborn</code>
</p>

<ul class="org-ul">
<li>With his obdurate personality and intense dislike for people, Jonathan had all the makings of a professional killer.
</li>
<li>Sometimes, you are too obdurate for your own good!
</li>
<li>Despite the defendant’s apology, the judge was obdurate and gave him a thirty-year sentence.
</li>
<li>Because Janice was obdurate, she did not shed a single tear while hearing the tragic story.
</li>
<li>Even though his fellow teammates urged him to accept the new coach, the star basketball player remained obdurate and refused to follow the coach’s directions.
</li>
<li>The protestors were obdurate and did not move even when the police arrived.
</li>
<li>Will you stop being so obdurate and at least listen to my point of view?
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/obfuscate-in-a-sentence/">Obfuscate</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>to deliberately make something confusing or difficult to understand</code>
</p>

<ul class="org-ul">
<li>The loan contract was filled with legal words meant to obfuscate trusting borrowers.
</li>
<li>Because I am a sympathetic teacher, I avoid using language which will obfuscate my students.
</li>
<li>Surprisingly, the efforts of the translator only served to obfuscate an already confusing conversation.
</li>
<li>The last thing I want to do is obfuscate the concept by trying to explain it too rapidly.
</li>
<li>If you will obfuscate the store clerk with some crazy questions, I will steal the candy.
</li>
<li>The con man hoped to obfuscate the elderly woman by using large words to describe his investment plan.
</li>
<li>Because I am honest, I never try to obfuscate my true intentions!
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/obligate-in-a-sentence/">Obligate</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>to be required or forced</code>
</p>

<ul class="org-ul">
<li>All citizens of the United States must obligate to vote in every election as their civic duty.
</li>
<li>Witnesses of the crime will obligate to stand before the court and state what they saw at the scene in order for the criminal to be found guilty.
</li>
<li>After years of the same Christmas customs, my family members obligate to buy presents at least for all of the children in the family.
</li>
<li>All banks obligate people to repay their loans or take the chance of their credit being ruined.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/obligatory-in-a-sentence/">Obligatory</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>required by law or a set of rules</code>
</p>

<ul class="org-ul">
<li>As part of my obligatory court sentence, I must complete sixty hours of community service.
</li>
<li>New hires must attend the obligatory orientation session.
</li>
<li>Because Ray is an awesome host, he never fails to perform the obligatory duties like greeting each guest and keeping glasses full.
</li>
<li>Every cheesy spy movie has the obligatory fight scene that lasts at least fifteen minutes.
</li>
</ul>
</div>
</div>
