ruby/O.org
* [[https://wordsinasentence.com/oblige-in-a-sentence/][Oblige]]

  =perform a good deed for someone=

  - Since my neighbor cuts my grass for free, I am happy to oblige him with a ride to the store.
  - If you would like to see certain things on your tour, please tell the guide so she can oblige your requests if time permits.
  - Sheila was happy to oblige the soldier with bus fare home.
  - When Jack asked for a loan, his father could not oblige him because of his recent job loss.

* [[https://wordsinasentence.com/obliging-in-a-sentence/][Obliging]]

  =accommodating; willing to be of assistance=

  - The obliging clerk was pleased to answer my numerous questions about the store.
  - Because my waitress appeared happy to serve me, her obliging nature earned her a huge tip.
  - Jack was very obliging at work because he wanted to earn a promotion.
  - Out of fear of being whipped or killed, the slaves were obliging to their masters.

* [[https://wordsinasentence.com/obliterate-in-a-sentence/][Obliterate]]

  =to destroy=

  - The dictator’s army is going to obliterate the rebel’s small village in less than five minutes.
  - Although I spent hours building my daughter’s dollhouse, I was shocked to watch her obliterate it simply by pulling out one of the support columns.
  - Hank’s cheating is sure to obliterate his twenty-year marriage to Helen.
  - If a plane lands on your home, it will obliterate your property.
  - The property developers are going to obliterate the rainforest if they keep cutting down trees and driving out wildlife.
  - According to scientists, the nuclear weapon has the capacity to obliterate the entire city.
  - The general’s plan is to obliterate the enemy’s military runways so their fighter planes cannot launch an aerial attack.

* [[https://wordsinasentence.com/oblivious-in-a-sentence/][Oblivious]]

  =unaware of what is present or occurring=

  - The huge dog closed its eyes and appeared oblivious to the crawling baby.
  - How could the rich man be oblivious to the hungry man asking him for a dollar?
  - As Gene rapidly ate his dinner, he seemed oblivious to the taste of the burnt food.
  - The absent-minded couple acted oblivious to the mess their child made in the restaurant.

* [[https://wordsinasentence.com/obsequious-in-a-sentence/][Obsequious]]

  =Excessively submissive; overly obedient=

  - The princess had obsequious servants who showered her with attention.
  - At work, the obsequious assistant complimented her manager so much that she quickly advanced up the corporate ladder.
  - When he receives obsequious service, Lawrence always leaves a huge tip.
  - Extremely obsequious, most puppies want nothing more than to please their masters.
  - From his obsequious behavior, it was obvious Jackson was smitten with his wife.
  - It infuriates me that your obsequious personality makes you agree with every word I say!
  - Jane is the teacher’s favorite because she is so obsequious in class.

* [[https://wordsinasentence.com/obsolescence-in-a-sentence/][Obsolescence]]

  =becoming outdated=

  - Since the granite countertops were such an obsolescence in the neighborhood homes, the builder knew he would need to upgrade to higher quality materials like marble.
  - Due to the obsolescence of the car’s transmission, the mechanic knew he couldn’t purchase the needed transmission from any manufacturer in the world.
  - Once cell phones became equipped with visual tools, regular cameras became an obsolescence in the technological industry.
  - As I was cleaning out the office supply closet at work, I knew the shelf containing items of obsolescence like typewriter ribbon could be tossed out.

* [[https://wordsinasentence.com/obstinacy-in-a-sentence/][Obstinacy]]

  =the quality of refusing to be reasonable and change your behavior, plans, or ideas; stubborness=

  - Although the detectives grilled the witness for hours, his obstinacy in sticking to his story finally convinced them that he was telling the truth.
  - The obstinacy of both children in insisting on their own choice of movie resulted in an evening with no movie at all.
  - Lindsey just would not let go of her obstinacy over a vacation that didn’t involve tents and latrines, so Benjamin finally put his camping gear away and agreed to talk to a travel agent.
  - If it hadn’t been for Mason’s obstinacy and his mother’s anxiety, he probably would have been potty-trained months sooner.
  - No matter what logic or rationale I used, nothing I came up with could break through her obstinacy.
  - Because his obstinacy is greater than his judgment, Miles will never back down in a dispute.
  - Nora went suicide during Rush because she had her heart set on getting into just one sorority, but her obstinacy left her out in the cold when the bids went out.

* [[https://wordsinasentence.com/obstinate-in-a-sentence/][Obstinate]]

  =stubbornly refusing to change one's opinion or action; very difficult to change or persuade; refusing to obey=

  - Everyone described my grandfather as the most obstinate man alive!
  - Although the little boy knew he was wrong, he was too obstinate to apologize to his parents.
  - Obstinate and unyielding, the judge refused to give the defendant credit for time served.
  - The obstinate protestors refused to leave the office complex.
  - Because she is so obstinate, my niece often ends up eating dinner alone in her room.
  - Even though Henry’s friends wanted him to join them at the arcade, he remained obstinate and went to the library to study.
  - Cheryl was obstinate and refused to admit her marriage was over.

* [[https://wordsinasentence.com/obviate-in-a-sentence/][Obviate]]

  =to prevent or eliminate=

  - We replaced the old mechanisms because we wanted to obviate any nervousness about potential breakdown.
  - I tried to obviate my mother’s awkwardness with the cell phone by telling her it wasn’t necessary to hold it up to her mouth when she speaks into it.
  - Because he wanted to obviate the strain of climbing the stairs, Dr. Johnson ordered the patient to have his bedroom furniture moved to the room on the bottom floor.
  - Even though the government has employed many safeguards to obviate abuse of the welfare system, there are still too many people robbing the taxpayers through fraudulent claims.
  - After his mother had fallen in the bathtub, Farley installed safety rails in order to obviate any recurrence of such a mishap.
  - Because our mother was always inclined to obviate conflict under any circumstances, we all got our own gifts on our siblings’ birthdays.
  - If you want to obviate the risk of skin cancer throughout your life, it’s important that you are protected from sun exposure from the time you are an infant.

