ruby/O.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/oblige-in-a-sentence/">Oblige</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>perform a good deed for someone</code>
</p>

<ul class="org-ul">
<li>Since my neighbor cuts my grass for free, I am happy to oblige him with a ride to the store.
</li>
<li>If you would like to see certain things on your tour, please tell the guide so she can oblige your requests if time permits.
</li>
<li>Sheila was happy to oblige the soldier with bus fare home.
</li>
<li>When Jack asked for a loan, his father could not oblige him because of his recent job loss.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/obliging-in-a-sentence/">Obliging</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>accommodating; willing to be of assistance</code>
</p>

<ul class="org-ul">
<li>The obliging clerk was pleased to answer my numerous questions about the store.
</li>
<li>Because my waitress appeared happy to serve me, her obliging nature earned her a huge tip.
</li>
<li>Jack was very obliging at work because he wanted to earn a promotion.
</li>
<li>Out of fear of being whipped or killed, the slaves were obliging to their masters.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/obliterate-in-a-sentence/">Obliterate</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>to destroy</code>
</p>

<ul class="org-ul">
<li>The dictator’s army is going to obliterate the rebel’s small village in less than five minutes.
</li>
<li>Although I spent hours building my daughter’s dollhouse, I was shocked to watch her obliterate it simply by pulling out one of the support columns.
</li>
<li>Hank’s cheating is sure to obliterate his twenty-year marriage to Helen.
</li>
<li>If a plane lands on your home, it will obliterate your property.
</li>
<li>The property developers are going to obliterate the rainforest if they keep cutting down trees and driving out wildlife.
</li>
<li>According to scientists, the nuclear weapon has the capacity to obliterate the entire city.
</li>
<li>The general’s plan is to obliterate the enemy’s military runways so their fighter planes cannot launch an aerial attack.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/oblivious-in-a-sentence/">Oblivious</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>unaware of what is present or occurring</code>
</p>

<ul class="org-ul">
<li>The huge dog closed its eyes and appeared oblivious to the crawling baby.
</li>
<li>How could the rich man be oblivious to the hungry man asking him for a dollar?
</li>
<li>As Gene rapidly ate his dinner, he seemed oblivious to the taste of the burnt food.
</li>
<li>The absent-minded couple acted oblivious to the mess their child made in the restaurant.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/obsequious-in-a-sentence/">Obsequious</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>Excessively submissive; overly obedient</code>
</p>

<ul class="org-ul">
<li>The princess had obsequious servants who showered her with attention.
</li>
<li>At work, the obsequious assistant complimented her manager so much that she quickly advanced up the corporate ladder.
</li>
<li>When he receives obsequious service, Lawrence always leaves a huge tip.
</li>
<li>Extremely obsequious, most puppies want nothing more than to please their masters.
</li>
<li>From his obsequious behavior, it was obvious Jackson was smitten with his wife.
</li>
<li>It infuriates me that your obsequious personality makes you agree with every word I say!
</li>
<li>Jane is the teacher’s favorite because she is so obsequious in class.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/obsolescence-in-a-sentence/">Obsolescence</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>becoming outdated</code>
</p>

<ul class="org-ul">
<li>Since the granite countertops were such an obsolescence in the neighborhood homes, the builder knew he would need to upgrade to higher quality materials like marble.
</li>
<li>Due to the obsolescence of the car’s transmission, the mechanic knew he couldn’t purchase the needed transmission from any manufacturer in the world.
</li>
<li>Once cell phones became equipped with visual tools, regular cameras became an obsolescence in the technological industry.
</li>
<li>As I was cleaning out the office supply closet at work, I knew the shelf containing items of obsolescence like typewriter ribbon could be tossed out.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/obstinacy-in-a-sentence/">Obstinacy</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>the quality of refusing to be reasonable and change your behavior, plans, or ideas; stubborness</code>
</p>

<ul class="org-ul">
<li>Although the detectives grilled the witness for hours, his obstinacy in sticking to his story finally convinced them that he was telling the truth.
</li>
<li>The obstinacy of both children in insisting on their own choice of movie resulted in an evening with no movie at all.
</li>
<li>Lindsey just would not let go of her obstinacy over a vacation that didn’t involve tents and latrines, so Benjamin finally put his camping gear away and agreed to talk to a travel agent.
</li>
<li>If it hadn’t been for Mason’s obstinacy and his mother’s anxiety, he probably would have been potty-trained months sooner.
</li>
<li>No matter what logic or rationale I used, nothing I came up with could break through her obstinacy.
</li>
<li>Because his obstinacy is greater than his judgment, Miles will never back down in a dispute.
</li>
<li>Nora went suicide during Rush because she had her heart set on getting into just one sorority, but her obstinacy left her out in the cold when the bids went out.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/obstinate-in-a-sentence/">Obstinate</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>stubbornly refusing to change one's opinion or action; very difficult to change or persuade; refusing to obey</code>
</p>

<ul class="org-ul">
<li>Everyone described my grandfather as the most obstinate man alive!
</li>
<li>Although the little boy knew he was wrong, he was too obstinate to apologize to his parents.
</li>
<li>Obstinate and unyielding, the judge refused to give the defendant credit for time served.
</li>
<li>The obstinate protestors refused to leave the office complex.
</li>
<li>Because she is so obstinate, my niece often ends up eating dinner alone in her room.
</li>
<li>Even though Henry’s friends wanted him to join them at the arcade, he remained obstinate and went to the library to study.
</li>
<li>Cheryl was obstinate and refused to admit her marriage was over.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/obviate-in-a-sentence/">Obviate</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>to prevent or eliminate</code>
</p>

<ul class="org-ul">
<li>We replaced the old mechanisms because we wanted to obviate any nervousness about potential breakdown.
</li>
<li>I tried to obviate my mother’s awkwardness with the cell phone by telling her it wasn’t necessary to hold it up to her mouth when she speaks into it.
</li>
<li>Because he wanted to obviate the strain of climbing the stairs, Dr. Johnson ordered the patient to have his bedroom furniture moved to the room on the bottom floor.
</li>
<li>Even though the government has employed many safeguards to obviate abuse of the welfare system, there are still too many people robbing the taxpayers through fraudulent claims.
</li>
<li>After his mother had fallen in the bathtub, Farley installed safety rails in order to obviate any recurrence of such a mishap.
</li>
<li>Because our mother was always inclined to obviate conflict under any circumstances, we all got our own gifts on our siblings’ birthdays.
</li>
<li>If you want to obviate the risk of skin cancer throughout your life, it’s important that you are protected from sun exposure from the time you are an infant.
</li>
</ul>
</div>
</div>
