ruby/O.org
* [[https://wordsinasentence.com/opprobrious-in-a-sentence/][Opprobrious]]

  =conveying shame or contempt=

  - Elaine was offended by her friends’ opprobrious remarks about her drunken behavior.
  - At the party, a suspicious Kim was convinced her friends were making opprobrious comments about her appearance.
  - The boy is sure to be kicked out of school for directing opprobrious remarks to his principal.
  - Did you see the teacher’s shocked expression when the student called her an opprobrious word?



* [[https://wordsinasentence.com/optimism-in-a-sentence/][Optimism]]

  =hopefulness about things to come=

  - Gail’s optimism allows her to believe anything is possible.
  - Although I hate my coworkers, I try to get along with them because my optimism reminds me my job is only temporary.
  - Jake’s optimism decreased when his boss told him his services were no longer needed.
  - If a person does not have optimism, he or she will not look forward to the future.



* [[https://wordsinasentence.com/opulent-in-a-sentence/][Opulent]]

  =extravagant and rich=

  - Because the movie star made over ten million dollars a film, she was able to maintain an opulent lifestyle.
  - We were afraid to sit in the chairs because they looked so opulent.
  - Although the hotel was filled with opulent designer furnishings, its room rates were surprisingly affordable.
  - The couple spent over eighty thousand dollars on opulent kitchen appliances.
  - Even though the evil king knew many of his people were dying of starvation, he continued to spend money decorating his opulent castle.
  - The hotel’s opulent facilities include four gourmet restaurants, a movie theater, and an indoor tennis court.
  - If Jackie does not get a large divorce settlement, she will not be able to maintain her opulent style of living.



* [[https://wordsinasentence.com/ordeal-in-a-sentence/][Ordeal]]

  =a tough experience=

  - The eighteen-hour plane trip was an ordeal for my hyperactive toddler.
  - Even the experienced wedding planner found it quite an ordeal to plan and execute a ceremony in twenty-four hours.
  - The hostage endured a horrible ordeal under the hands of his abusive kidnappers.
  - For my teenage daughter going without her mobile phone for a day is a real ordeal.



* [[https://wordsinasentence.com/ossify-in-a-sentence/][Ossify]]

  =to become firm in a certain way=

  - My father’s opinion has started to ossify so I know he won’t change his mind.
  - Because Elaine has an impulsive nature, she’ll never allow her behaviors to ossify.
  - This type of arthritis causes the joints to ossify to the point they become immobile.
  - After Tim joined the church, his beliefs about the afterlife started to ossify.



* [[https://wordsinasentence.com/ostentatious-in-a-sentence/][Ostentatious]]

  =intended to attract notice and impress others in an extreme and unnecessary way=

  - I tried to tell Mary her fur coat was a bit too ostentatious to be worn at a funeral!
  - Even though Larry has a gigantic art collection, he does not present it in an ostentatious manner to everyone who enters his home.
  - My wealthy aunt who enjoys flaunting her wealth always wears an ostentatious diamond necklace.
  - Although Henry was a millionaire, no one ever considered him ostentatious because of the laid-back way in which he carried himself.
  - Everyone could tell the singer was a diva simply by looking at her brightly-colored ostentatious outfit.
  - Because Sarah puts up at least two thousand Christmas lights each year, she always has the most ostentatious decorations in our neighborhood.
  - The little girl’s birthday party was an ostentatious affair with live ponies, a chocolate fountain, and a six-tier cake.




* [[https://wordsinasentence.com/ostracize-in-a-sentence/][Ostracize]]

  =exclude someone=

  - As a teacher, your job is not to ostracize your students but to show them support so they can become contributing members of society.
  - Sadly, the rich children ostracize the other girl because she comes from a poor family.
  - Although Margie was not responsible for the court’s decision in her favor, she knows the people on the other side of the courtroom will still ostracize her.
  - Can you believe that country still has laws, which allow it to ostracize people of the Christian faith and treat them like second-class citizens?
  - In some countries, having different beliefs may cause people to ostracize you and deny you access to certain places.
  - Bill knew his community would ostracize him after his release from prison so he moved to another town.
  - Unfortunately, teenagers will ostracize their peers and make them feel unwanted for the simplest reasons.

* [[https://wordsinasentence.com/oust-in-a-sentence/][Oust]]

  =to banish or kick out=

  - Environmental specialists would prefer to oust herbicides because they can cause health problems and diseases to many people.
  - Many citizens of Germany wanted to oust Adolf Hitler but were too scared to do anything about it.
  - Board members realized that they would have to have at least a 2/3 vote to oust the horrible president.
  - Since the CEO was the top man at the company, it would be almost impossible for anyone to oust him.



* [[https://wordsinasentence.com/outgoing-in-a-sentence/][Outgoing]]

  =sociable and friendly=

  - Due to her outgoing personality, Kim made friends who always wanted to be around her.
  - Since opposites attract, the outgoing wife always got along with her introverted husband.
  - The saleswoman made her customers feel very welcome and comfortable since she was such an outgoing person.
  - When no one spoke up after the teacher asked a question, the outgoing boy was willing to share his answers with the rest of the class.



* [[https://wordsinasentence.com/outstrip-in-a-sentence/][Outstrip]]

  =to move further=

  - Being trained for the Kentucky Derby, these horses outstrip any of the other horses running down the track.
  - “If you want to outstrip the competition, then you need to work out at the gym,” the coach told his athletes.
  - In a race of the transportation, a train would outstrip a horse because a train has an engine.
  - Even though the marathon runner was a senior citizen, he could outstrip the young 20-year old due to his experience in running.



