ruby/O.html



<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/opprobrious-in-a-sentence/">Opprobrious</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>conveying shame or contempt</code>
</p>

<ul class="org-ul">
<li>Elaine was offended by her friends’ opprobrious remarks about her drunken behavior.
</li>
<li>At the party, a suspicious Kim was convinced her friends were making opprobrious comments about her appearance.
</li>
<li>The boy is sure to be kicked out of school for directing opprobrious remarks to his principal.
</li>
<li>Did you see the teacher’s shocked expression when the student called her an opprobrious word?
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/optimism-in-a-sentence/">Optimism</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>hopefulness about things to come</code>
</p>

<ul class="org-ul">
<li>Gail’s optimism allows her to believe anything is possible.
</li>
<li>Although I hate my coworkers, I try to get along with them because my optimism reminds me my job is only temporary.
</li>
<li>Jake’s optimism decreased when his boss told him his services were no longer needed.
</li>
<li>If a person does not have optimism, he or she will not look forward to the future.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/opulent-in-a-sentence/">Opulent</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>extravagant and rich</code>
</p>

<ul class="org-ul">
<li>Because the movie star made over ten million dollars a film, she was able to maintain an opulent lifestyle.
</li>
<li>We were afraid to sit in the chairs because they looked so opulent.
</li>
<li>Although the hotel was filled with opulent designer furnishings, its room rates were surprisingly affordable.
</li>
<li>The couple spent over eighty thousand dollars on opulent kitchen appliances.
</li>
<li>Even though the evil king knew many of his people were dying of starvation, he continued to spend money decorating his opulent castle.
</li>
<li>The hotel’s opulent facilities include four gourmet restaurants, a movie theater, and an indoor tennis court.
</li>
<li>If Jackie does not get a large divorce settlement, she will not be able to maintain her opulent style of living.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/ordeal-in-a-sentence/">Ordeal</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>a tough experience</code>
</p>

<ul class="org-ul">
<li>The eighteen-hour plane trip was an ordeal for my hyperactive toddler.
</li>
<li>Even the experienced wedding planner found it quite an ordeal to plan and execute a ceremony in twenty-four hours.
</li>
<li>The hostage endured a horrible ordeal under the hands of his abusive kidnappers.
</li>
<li>For my teenage daughter going without her mobile phone for a day is a real ordeal.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/ossify-in-a-sentence/">Ossify</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>to become firm in a certain way</code>
</p>

<ul class="org-ul">
<li>My father’s opinion has started to ossify so I know he won’t change his mind.
</li>
<li>Because Elaine has an impulsive nature, she’ll never allow her behaviors to ossify.
</li>
<li>This type of arthritis causes the joints to ossify to the point they become immobile.
</li>
<li>After Tim joined the church, his beliefs about the afterlife started to ossify.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/ostentatious-in-a-sentence/">Ostentatious</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>intended to attract notice and impress others in an extreme and unnecessary way</code>
</p>

<ul class="org-ul">
<li>I tried to tell Mary her fur coat was a bit too ostentatious to be worn at a funeral!
</li>
<li>Even though Larry has a gigantic art collection, he does not present it in an ostentatious manner to everyone who enters his home.
</li>
<li>My wealthy aunt who enjoys flaunting her wealth always wears an ostentatious diamond necklace.
</li>
<li>Although Henry was a millionaire, no one ever considered him ostentatious because of the laid-back way in which he carried himself.
</li>
<li>Everyone could tell the singer was a diva simply by looking at her brightly-colored ostentatious outfit.
</li>
<li>Because Sarah puts up at least two thousand Christmas lights each year, she always has the most ostentatious decorations in our neighborhood.
</li>
<li>The little girl’s birthday party was an ostentatious affair with live ponies, a chocolate fountain, and a six-tier cake.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/ostracize-in-a-sentence/">Ostracize</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>exclude someone</code>
</p>

<ul class="org-ul">
<li>As a teacher, your job is not to ostracize your students but to show them support so they can become contributing members of society.
</li>
<li>Sadly, the rich children ostracize the other girl because she comes from a poor family.
</li>
<li>Although Margie was not responsible for the court’s decision in her favor, she knows the people on the other side of the courtroom will still ostracize her.
</li>
<li>Can you believe that country still has laws, which allow it to ostracize people of the Christian faith and treat them like second-class citizens?
</li>
<li>In some countries, having different beliefs may cause people to ostracize you and deny you access to certain places.
</li>
<li>Bill knew his community would ostracize him after his release from prison so he moved to another town.
</li>
<li>Unfortunately, teenagers will ostracize their peers and make them feel unwanted for the simplest reasons.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/oust-in-a-sentence/">Oust</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>to banish or kick out</code>
</p>

<ul class="org-ul">
<li>Environmental specialists would prefer to oust herbicides because they can cause health problems and diseases to many people.
</li>
<li>Many citizens of Germany wanted to oust Adolf Hitler but were too scared to do anything about it.
</li>
<li>Board members realized that they would have to have at least a 2/3 vote to oust the horrible president.
</li>
<li>Since the CEO was the top man at the company, it would be almost impossible for anyone to oust him.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/outgoing-in-a-sentence/">Outgoing</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>sociable and friendly</code>
</p>

<ul class="org-ul">
<li>Due to her outgoing personality, Kim made friends who always wanted to be around her.
</li>
<li>Since opposites attract, the outgoing wife always got along with her introverted husband.
</li>
<li>The saleswoman made her customers feel very welcome and comfortable since she was such an outgoing person.
</li>
<li>When no one spoke up after the teacher asked a question, the outgoing boy was willing to share his answers with the rest of the class.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/outstrip-in-a-sentence/">Outstrip</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>to move further</code>
</p>

<ul class="org-ul">
<li>Being trained for the Kentucky Derby, these horses outstrip any of the other horses running down the track.
</li>
<li>“If you want to outstrip the competition, then you need to work out at the gym,” the coach told his athletes.
</li>
<li>In a race of the transportation, a train would outstrip a horse because a train has an engine.
</li>
<li>Even though the marathon runner was a senior citizen, he could outstrip the young 20-year old due to his experience in running.
</li>
</ul>
</div>
</div>
