ruby/O.org
* [[https://wordsinasentence.com/overbearing-in-a-sentence/][Overbearing]]

  =overly bossy, domineering, or arrogant=

  - Debra has a tendency to act in an overbearing and domineering way which tends to turn Ted off.
  - Sally felt that the cop acted in a very overbearing way when he yelled at her to pull off of the road.
  - After years of living with a bossy and overbearing wife, Max decided to divorce her.
  - Veronica prefers to avoid scents that are overbearing, opting for perfumes that are airy and light.


* [[https://wordsinasentence.com/overcast-in-a-sentence/][Overcast]]

  =cloudy; gloomy=

  - The children wanted to go swimming, but the overcast day made it a little too cool to get into the pool.
  - Overcast skies and no humidity made it the perfect day to go fishing.
  - The dark and overcast day set a gloomy atmosphere even before the rain started.
  - Predicting overcast skies and an overall cloudy week, the weather man suggested getting any gardening done while it is cool.



* [[https://wordsinasentence.com/overdue-in-a-sentence/][Overdue]]

  =late; past due=

  - The overdue mother’s due date had passed a week ago and she couldn’t wait to have her baby.
  - Placing a note on the couple’s door, the landlord insisted that they pay their overdue rent.
  - I have several overdue books that need to be turned to the library so that I don’t owe a lot of fees.
  - The overdue Redbox money should have been returned last night, but I wanted to watch it again.

* [[https://wordsinasentence.com/override-in-a-sentence/][Override]]

  =To use one’s authority to cancel or overrule the action or decision of another=

  - A manager is needed to override the transaction if the clerk makes a mistake.
  - The president has decided to override his advisors’ decision and put his own plan in place.
  - In order to delete the purchase, an override must occur and a code must be entered.
  - Without a way to override his boss’s decision, Paul had to make the best of the situation.



* [[https://wordsinasentence.com/overt-in-a-sentence/][Overt]]

  =open and not secret=

  - In some countries, racial prejudice is overt and not disguised in the least.
  - The film’s R rating is based on its content’s overt violence and sexual acts.
  - Because of Frank’s religious beliefs, he was able to forgive his attackers for their overt hatred.
  - It was an obvious case of overt discrimination when the newly hired Caucasian man was promoted instead of the African American worker who had been with the firm for ten years.
  - As soon as Beverly saw the dog’s overt aggression, she stood in front of her daughter to protect her.
  - The security guard easily noticed the shoplifter’s overt actions.
  - Since the detective is an observant fellow, he can easily notice facts that are not overt.




* [[https://wordsinasentence.com/overwrought-in-a-sentence/][Overwrought]]

  =in a state of excessive nervousness, excitement, or anger=

  - The bride was overwrought when the florist delivered the wrong flower order.
  - An overwrought mom frantically searched the park for her missing son.
  - The man’s wife was completely overwrought at his funeral.
  - When she was not awarded a scholarship, the student became overwrought.




* [[https://wordsinasentence.com/oath-in-a-sentence/][Oath]]

  =a solemn promise=

  - Jurors convicted the man of lying during trial while under oath.
  - A huge crowd surrounded the court house while the newly elected officials took the oath of office.
  - Giving an oath to love her forever, the groom was instructed to kiss the bride.
  - Crossing his fingers while he gave an oath to protect and serve, the scoundrel smiled at his unsuspecting victims.



* [[https://wordsinasentence.com/obeisance-in-a-sentence/][Obeisance]]

  =a respectful obedient attitude=

  - In my family, we say a prayer before each meal to show obeisance and thanks.
  - Obeisance is not one of the rude secretary’s personality traits.
  - Because the teenage troublemaker showed a sign of obeisance, the judge let him off with a warning.
  - The young girl showed obeisance when she bowed before the queen.
  - The villagers displayed their obeisance to their god by kneeling at his altar.
  - With obeisance, Ray apologized to his parents for missing his curfew.
  - I often open doors for senior citizens as a sign of obeisance.



* [[https://wordsinasentence.com/objection-in-a-sentence/][Objection]]

  =a purpose for opposing or protesting a statement or action=

  - Everyone frowned when the father of the bride unjustly stated his objection to the marriage for the lovely young couple.
  - Before suing his neighbor, Mr. Bills discussed his objection with the neighbor’s fence being installed on his property.
  - The strictly religious woman argued her objection to her son’s school because the school’s celebration of Halloween violated her son’s religious rights.
  - During the Vietnam War, the United States felt a division of loyalty when common citizens would voice an objection to the war.



* [[https://wordsinasentence.com/oblige-in-a-sentence/][Oblige]]

  =perform a good deed for someone=

  - Since my neighbor cuts my grass for free, I am happy to oblige him with a ride to the store.
  - If you would like to see certain things on your tour, please tell the guide so she can oblige your requests if time permits.
  - Sheila was happy to oblige the soldier with bus fare home.
  - When Jack asked for a loan, his father could not oblige him because of his recent job loss.

* [[https://wordsinasentence.com/oblique-in-a-sentence/][Oblique]]

  =not in a straightforward manner=

  - The slight wink was Larry’s oblique way of flirting with me.
  - Because the commercial is oblique in its sexual references, it has not been pulled from the Christian network.
  - Putting a dead rat on a person’s doorstep is an oblique way in which the mob has been known to warn possible snitches.
  - To avoid worrying his wife, the man made an oblique statement about the seriousness of his medical condition.

