ruby/O.html



<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/overbearing-in-a-sentence/">Overbearing</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>overly bossy, domineering, or arrogant</code>
</p>

<ul class="org-ul">
<li>Debra has a tendency to act in an overbearing and domineering way which tends to turn Ted off.
</li>
<li>Sally felt that the cop acted in a very overbearing way when he yelled at her to pull off of the road.
</li>
<li>After years of living with a bossy and overbearing wife, Max decided to divorce her.
</li>
<li>Veronica prefers to avoid scents that are overbearing, opting for perfumes that are airy and light.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/overcast-in-a-sentence/">Overcast</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>cloudy; gloomy</code>
</p>

<ul class="org-ul">
<li>The children wanted to go swimming, but the overcast day made it a little too cool to get into the pool.
</li>
<li>Overcast skies and no humidity made it the perfect day to go fishing.
</li>
<li>The dark and overcast day set a gloomy atmosphere even before the rain started.
</li>
<li>Predicting overcast skies and an overall cloudy week, the weather man suggested getting any gardening done while it is cool.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/overdue-in-a-sentence/">Overdue</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>late; past due</code>
</p>

<ul class="org-ul">
<li>The overdue mother’s due date had passed a week ago and she couldn’t wait to have her baby.
</li>
<li>Placing a note on the couple’s door, the landlord insisted that they pay their overdue rent.
</li>
<li>I have several overdue books that need to be turned to the library so that I don’t owe a lot of fees.
</li>
<li>The overdue Redbox money should have been returned last night, but I wanted to watch it again.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/override-in-a-sentence/">Override</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>To use one’s authority to cancel or overrule the action or decision of another</code>
</p>

<ul class="org-ul">
<li>A manager is needed to override the transaction if the clerk makes a mistake.
</li>
<li>The president has decided to override his advisors’ decision and put his own plan in place.
</li>
<li>In order to delete the purchase, an override must occur and a code must be entered.
</li>
<li>Without a way to override his boss’s decision, Paul had to make the best of the situation.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/overt-in-a-sentence/">Overt</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>open and not secret</code>
</p>

<ul class="org-ul">
<li>In some countries, racial prejudice is overt and not disguised in the least.
</li>
<li>The film’s R rating is based on its content’s overt violence and sexual acts.
</li>
<li>Because of Frank’s religious beliefs, he was able to forgive his attackers for their overt hatred.
</li>
<li>It was an obvious case of overt discrimination when the newly hired Caucasian man was promoted instead of the African American worker who had been with the firm for ten years.
</li>
<li>As soon as Beverly saw the dog’s overt aggression, she stood in front of her daughter to protect her.
</li>
<li>The security guard easily noticed the shoplifter’s overt actions.
</li>
<li>Since the detective is an observant fellow, he can easily notice facts that are not overt.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/overwrought-in-a-sentence/">Overwrought</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>in a state of excessive nervousness, excitement, or anger</code>
</p>

<ul class="org-ul">
<li>The bride was overwrought when the florist delivered the wrong flower order.
</li>
<li>An overwrought mom frantically searched the park for her missing son.
</li>
<li>The man’s wife was completely overwrought at his funeral.
</li>
<li>When she was not awarded a scholarship, the student became overwrought.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/oath-in-a-sentence/">Oath</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>a solemn promise</code>
</p>

<ul class="org-ul">
<li>Jurors convicted the man of lying during trial while under oath.
</li>
<li>A huge crowd surrounded the court house while the newly elected officials took the oath of office.
</li>
<li>Giving an oath to love her forever, the groom was instructed to kiss the bride.
</li>
<li>Crossing his fingers while he gave an oath to protect and serve, the scoundrel smiled at his unsuspecting victims.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/obeisance-in-a-sentence/">Obeisance</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>a respectful obedient attitude</code>
</p>

<ul class="org-ul">
<li>In my family, we say a prayer before each meal to show obeisance and thanks.
</li>
<li>Obeisance is not one of the rude secretary’s personality traits.
</li>
<li>Because the teenage troublemaker showed a sign of obeisance, the judge let him off with a warning.
</li>
<li>The young girl showed obeisance when she bowed before the queen.
</li>
<li>The villagers displayed their obeisance to their god by kneeling at his altar.
</li>
<li>With obeisance, Ray apologized to his parents for missing his curfew.
</li>
<li>I often open doors for senior citizens as a sign of obeisance.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/objection-in-a-sentence/">Objection</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>a purpose for opposing or protesting a statement or action</code>
</p>

<ul class="org-ul">
<li>Everyone frowned when the father of the bride unjustly stated his objection to the marriage for the lovely young couple.
</li>
<li>Before suing his neighbor, Mr. Bills discussed his objection with the neighbor’s fence being installed on his property.
</li>
<li>The strictly religious woman argued her objection to her son’s school because the school’s celebration of Halloween violated her son’s religious rights.
</li>
<li>During the Vietnam War, the United States felt a division of loyalty when common citizens would voice an objection to the war.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/oblige-in-a-sentence/">Oblige</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>perform a good deed for someone</code>
</p>

<ul class="org-ul">
<li>Since my neighbor cuts my grass for free, I am happy to oblige him with a ride to the store.
</li>
<li>If you would like to see certain things on your tour, please tell the guide so she can oblige your requests if time permits.
</li>
<li>Sheila was happy to oblige the soldier with bus fare home.
</li>
<li>When Jack asked for a loan, his father could not oblige him because of his recent job loss.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/oblique-in-a-sentence/">Oblique</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>not in a straightforward manner</code>
</p>

<ul class="org-ul">
<li>The slight wink was Larry’s oblique way of flirting with me.
</li>
<li>Because the commercial is oblique in its sexual references, it has not been pulled from the Christian network.
</li>
<li>Putting a dead rat on a person’s doorstep is an oblique way in which the mob has been known to warn possible snitches.
</li>
<li>To avoid worrying his wife, the man made an oblique statement about the seriousness of his medical condition.
</li>
</ul>
</div>
</div>
