ruby/O.org
* [[https://wordsinasentence.com/obloquy-in-a-sentence/][Obloquy]]

  =shame from public disapproval=

  - After being released from prison, Kurt lived in obloquy and rarely left his apartment.
  - The senator’s admission of adultery brought much obloquy and ended his political career.
  - Even though Jose knew telling the truth would bring obloquy from his gang, he refused to let his brother’s killer go free.
  - The soccer team went home to obloquy after losing the finals because of stupid mistakes.
  - Because Kate experienced obloquy after reporting the star quarterback for sexual assault, she changed schools.
  - James always felt obloquy because of his father’s infamy as a serial killer.
  - Since being arrested for associating with prostitutes, the minister has been in hiding to escape the obloquy of his actions.



* [[https://wordsinasentence.com/obnoxious-in-a-sentence/][Obnoxious]]

  =disagreeable in a way that disgusts other people=

  - Nobody wanted to talk to the obnoxious man.
  - As soon as I got on the plane and saw I’d be sitting next to an obnoxious child, I asked the flight attendant for another seat.
  - The man was asked to leave the restaurant because of his obnoxious behavior.
  - Did you notice the obnoxious person picking his nose at the dinner table?



* [[https://wordsinasentence.com/observance-in-a-sentence/][Observance]]

  =the act of conforming to situations and following rules=

  - Good students are in observance of the classroom rules by raising their hand to answer a question, speaking politely to others and keeping their hands and feet to themselves.
  - Their observance of silence resulted in the hush of the surrounding people until everyone was quiet in remembrance of the deceased man.
  - When the visitors entered the foreign country, they followed every traffic rule and ordinance due to their observance of the laws.
  - Once the exchange students become acclimated to the country’s culture, their observance of the traditions and customs will take place.



* [[https://wordsinasentence.com/obsolete-in-a-sentence/][Obsolete]]

  =no longer of use=

  - Many people believe the Internet has made the postal service obsolete.
  - If you look inside of most classrooms, you will not see chalkboards because they are nearly obsolete in education today.
  - Once Frank spent all of his lottery winnings, he became obsolete to his family members.
  - Despite what people say, I still use my VCR because it is not obsolete to me!



* [[https://wordsinasentence.com/obstinate-in-a-sentence/][Obstinate]]

  =stubbornly refusing to change one's opinion or action; very difficult to change or persuade; refusing to obey=

  - Everyone described my grandfather as the most obstinate man alive!
  - Although the little boy knew he was wrong, he was too obstinate to apologize to his parents.
  - Obstinate and unyielding, the judge refused to give the defendant credit for time served.
  - The obstinate protestors refused to leave the office complex.
  - Because she is so obstinate, my niece often ends up eating dinner alone in her room.
  - Even though Henry’s friends wanted him to join them at the arcade, he remained obstinate and went to the library to study.
  - Cheryl was obstinate and refused to admit her marriage was over.



* [[https://wordsinasentence.com/obstreperous-in-a-sentence/][Obstreperous]]

  =noisy and difficult to control=

  - Because my nephew is obstreperous, he often gets in trouble at school.
  - The teenagers became obstreperous when their school team lost the football game.
  - When my husband drinks too many beers, he becomes obstreperous.
  - The football fans were obstreperous throughout the championship game.
  - After winning the battle, the obstreperous troops had to be calmed down by their commanding officer.
  - If you see me at a dance club with my friends, you might think I am obstreperous because I like having a fun time.
  - When you are inside of a library, you should be quiet not obstreperous.



* [[https://wordsinasentence.com/obtrude-in-a-sentence/][Obtrude]]

  =to interrupt in an unpleasant manner=

  - Please silence your phones so they do not obtrude upon our meeting.
  - On our honeymoon, we put the do not disturb sign on our door so the maid would not obtrude on our privacy.
  - Just as I was about to have my first kiss, my mother chose to obtrude upon the special moment  by walking into my room.
  - How dare you obtrude upon my vacation by calling me with a work related issue!



* [[https://wordsinasentence.com/obtuse-in-a-sentence/][Obtuse]]

  =not able to think clearly or to understand what is obvious or simple=

  - Are you so obtuse that you will give away all your money to a fake charity?
  - The obtuse young man had a hard time understanding the simple instructions.
  - If you do not pay attention in math class, you may feel obtuse during the final exam.
  - Sometimes my youngest brother seems too obtuse to understand anything I say.
  - After taking the strong medication, Jenny was so obtuse she could not read the newspaper.
  - The obtuse student was not able to answer a single test question.
  - Because the man was obtuse after a night of partying, he was unable to pass his driver’s test.



* [[https://wordsinasentence.com/obverse-in-a-sentence/][Obverse]]

  =the reverse or foil of a certainty or fact=

  - While I thought my parents would be happy I got a job, the obverse was true when they learned I’d be working in a strip club.
  - Sadness is the obverse or opposite of happiness.
  - As a child, I quickly learned “no” was the disappointing obverse of “yes.”
  - To win the debate, you will need to prove the obverse of your opponent’s argument.



* [[https://wordsinasentence.com/occlude-in-a-sentence/][Occlude]]

  =to close up or block off=

  - The police officers have blocked off the road to occlude the bomb from the public.
  - Although I do not want you inside of my office, I will not occlude your entry by locking the door while I am away.
  - It is quite dangerous when blood clots occlude the flow of oxygen in the human body.
  - Since I do not like people looking inside of my home, I use blinds to occlude my windows.
  - It looks like the clouds are going to occlude the sun and ruin my picnic!
  - Because my parents did not trust strangers, they did everything they could to occlude me from the outside world.
  - During the surgery, the doctor will do everything possible to not occlude the flow of blood to the patient’s heart.

