ruby/O.html

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/obloquy-in-a-sentence/">Obloquy</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>shame from public disapproval</code>
</p>

<ul class="org-ul">
<li>After being released from prison, Kurt lived in obloquy and rarely left his apartment.
</li>
<li>The senator’s admission of adultery brought much obloquy and ended his political career.
</li>
<li>Even though Jose knew telling the truth would bring obloquy from his gang, he refused to let his brother’s killer go free.
</li>
<li>The soccer team went home to obloquy after losing the finals because of stupid mistakes.
</li>
<li>Because Kate experienced obloquy after reporting the star quarterback for sexual assault, she changed schools.
</li>
<li>James always felt obloquy because of his father’s infamy as a serial killer.
</li>
<li>Since being arrested for associating with prostitutes, the minister has been in hiding to escape the obloquy of his actions.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/obnoxious-in-a-sentence/">Obnoxious</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>disagreeable in a way that disgusts other people</code>
</p>

<ul class="org-ul">
<li>Nobody wanted to talk to the obnoxious man.
</li>
<li>As soon as I got on the plane and saw I’d be sitting next to an obnoxious child, I asked the flight attendant for another seat.
</li>
<li>The man was asked to leave the restaurant because of his obnoxious behavior.
</li>
<li>Did you notice the obnoxious person picking his nose at the dinner table?
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/observance-in-a-sentence/">Observance</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>the act of conforming to situations and following rules</code>
</p>

<ul class="org-ul">
<li>Good students are in observance of the classroom rules by raising their hand to answer a question, speaking politely to others and keeping their hands and feet to themselves.
</li>
<li>Their observance of silence resulted in the hush of the surrounding people until everyone was quiet in remembrance of the deceased man.
</li>
<li>When the visitors entered the foreign country, they followed every traffic rule and ordinance due to their observance of the laws.
</li>
<li>Once the exchange students become acclimated to the country’s culture, their observance of the traditions and customs will take place.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/obsolete-in-a-sentence/">Obsolete</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>no longer of use</code>
</p>

<ul class="org-ul">
<li>Many people believe the Internet has made the postal service obsolete.
</li>
<li>If you look inside of most classrooms, you will not see chalkboards because they are nearly obsolete in education today.
</li>
<li>Once Frank spent all of his lottery winnings, he became obsolete to his family members.
</li>
<li>Despite what people say, I still use my VCR because it is not obsolete to me!
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/obstinate-in-a-sentence/">Obstinate</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>stubbornly refusing to change one's opinion or action; very difficult to change or persuade; refusing to obey</code>
</p>

<ul class="org-ul">
<li>Everyone described my grandfather as the most obstinate man alive!
</li>
<li>Although the little boy knew he was wrong, he was too obstinate to apologize to his parents.
</li>
<li>Obstinate and unyielding, the judge refused to give the defendant credit for time served.
</li>
<li>The obstinate protestors refused to leave the office complex.
</li>
<li>Because she is so obstinate, my niece often ends up eating dinner alone in her room.
</li>
<li>Even though Henry’s friends wanted him to join them at the arcade, he remained obstinate and went to the library to study.
</li>
<li>Cheryl was obstinate and refused to admit her marriage was over.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/obstreperous-in-a-sentence/">Obstreperous</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>noisy and difficult to control</code>
</p>

<ul class="org-ul">
<li>Because my nephew is obstreperous, he often gets in trouble at school.
</li>
<li>The teenagers became obstreperous when their school team lost the football game.
</li>
<li>When my husband drinks too many beers, he becomes obstreperous.
</li>
<li>The football fans were obstreperous throughout the championship game.
</li>
<li>After winning the battle, the obstreperous troops had to be calmed down by their commanding officer.
</li>
<li>If you see me at a dance club with my friends, you might think I am obstreperous because I like having a fun time.
</li>
<li>When you are inside of a library, you should be quiet not obstreperous.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/obtrude-in-a-sentence/">Obtrude</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>to interrupt in an unpleasant manner</code>
</p>

<ul class="org-ul">
<li>Please silence your phones so they do not obtrude upon our meeting.
</li>
<li>On our honeymoon, we put the do not disturb sign on our door so the maid would not obtrude on our privacy.
</li>
<li>Just as I was about to have my first kiss, my mother chose to obtrude upon the special moment  by walking into my room.
</li>
<li>How dare you obtrude upon my vacation by calling me with a work related issue!
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/obtuse-in-a-sentence/">Obtuse</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>not able to think clearly or to understand what is obvious or simple</code>
</p>

<ul class="org-ul">
<li>Are you so obtuse that you will give away all your money to a fake charity?
</li>
<li>The obtuse young man had a hard time understanding the simple instructions.
</li>
<li>If you do not pay attention in math class, you may feel obtuse during the final exam.
</li>
<li>Sometimes my youngest brother seems too obtuse to understand anything I say.
</li>
<li>After taking the strong medication, Jenny was so obtuse she could not read the newspaper.
</li>
<li>The obtuse student was not able to answer a single test question.
</li>
<li>Because the man was obtuse after a night of partying, he was unable to pass his driver’s test.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/obverse-in-a-sentence/">Obverse</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>the reverse or foil of a certainty or fact</code>
</p>

<ul class="org-ul">
<li>While I thought my parents would be happy I got a job, the obverse was true when they learned I’d be working in a strip club.
</li>
<li>Sadness is the obverse or opposite of happiness.
</li>
<li>As a child, I quickly learned “no” was the disappointing obverse of “yes.”
</li>
<li>To win the debate, you will need to prove the obverse of your opponent’s argument.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/occlude-in-a-sentence/">Occlude</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>to close up or block off</code>
</p>

<ul class="org-ul">
<li>The police officers have blocked off the road to occlude the bomb from the public.
</li>
<li>Although I do not want you inside of my office, I will not occlude your entry by locking the door while I am away.
</li>
<li>It is quite dangerous when blood clots occlude the flow of oxygen in the human body.
</li>
<li>Since I do not like people looking inside of my home, I use blinds to occlude my windows.
</li>
<li>It looks like the clouds are going to occlude the sun and ruin my picnic!
</li>
<li>Because my parents did not trust strangers, they did everything they could to occlude me from the outside world.
</li>
<li>During the surgery, the doctor will do everything possible to not occlude the flow of blood to the patient’s heart.
</li>
</ul>
</div>
</div>
