ruby/O.org
* [[https://wordsinasentence.com/occult-in-a-sentence/][Occult]]

  =relating to magical or supernatural abilities=

  - The occult show about a group of teenage witches living together is one of the highest rated shows on television.
  - Although the pretend psychic has no occult powers, she leads people to believe she does.
  - It is said that on Halloween night all the occult creatures walk the Earth.
  - Can you believe Sarah is going to take the occult arts class so she can learn how to torture her ex-husband from a distance?
  - Surprisingly, the nonfiction author is writing a novel that centers on an old man who engages in occult science to bring his wife back from the dead.
  - As soon as I learned the occult ritual involved killing a rabbit, I knew I wanted no part of the family’s annual tradition.
  - Mary’s occult shop contains a variety of spell books, herbs, and magical cards and crystals.

* [[https://wordsinasentence.com/ocular-in-a-sentence/][Ocular]]

  =associated with vision or eyesight=

  - Ocular pain forced me to call my eye doctor.
  - When my teenaged daughter learned she needed an ocular device to improve her vision, she immediately requested contact lenses.
  - Scientists wear goggles in the lab to prevent ocular injury.
  - If the ocular disease remains untreated, it could cause blindness.



* [[https://wordsinasentence.com/ode-in-a-sentence/][Ode]]

  =a poem that praises or celebrates something=

  - Phil created lyrics for the choir that were an ode to his alma mater.
  - Mel recited a beautiful ode under his sister’s wedding canopy while softly strumming on his guitar.
  - The poet spent years writing an ode that takes many hours to recite.
  - I wrote an ode to the United States and asked Jeff to recite it at the parade.



* [[https://wordsinasentence.com/odium-in-a-sentence/][Odium]]

  =loathing for a thing or person deemed to be despicable=

  - The public’s odium towards the congressman is an advantage for the candidate opposing him in the election.
  - After getting out of prison, the child molester still had to deal with odium from his neighbors.
  - The new abortion bill is sure to trigger odium from church leaders.
  - Because of my odium for the politician’s views, I have no plans to vote for him.



* [[https://wordsinasentence.com/odoriferous-in-a-sentence/][Odoriferous]]

  =producing an unpleasant scent=

  - After eating six burritos, my brother turned the bathroom into an odoriferous chamber.
  - The rotting corpse transformed the tiny house into an odoriferous dwelling.
  - The pregnant woman became nauseated when she smelled the scent from the odoriferous fish market.
  - The dog’s odoriferous gassiness made everyone leave the room.



* [[https://wordsinasentence.com/ogle-in-a-sentence/][Ogle]]

  =to look at in a suggestive manner=

  - Because the women feel the construction workers ogle them, they hate to walk by the unfinished building.
  - The football players ogle the cheerleaders when they should be listening to their coach.
  - While the nerdy guys ogle the pretty girls at the party, they are too shy to invite them to dance.
  - The boys sneaked into their father’s room to ogle his adult magazines.




* [[https://wordsinasentence.com/ointment-in-a-sentence/][Ointment]]

  =a cream rubbed on the skin for medicinal purposes=

  - Antibiotic ointment was applied to the wound to keep bacteria at bay.
  - The homeopathic physician assured the depressed woman that spreading the ointment allover her body would cure her.
  - The oily ointment was great for the player’s sore knee but ruined his clothing.
  - Squeezing the ointment out of the tube, the boy rubbed the gooey contents onto his scraped knee.



* [[https://wordsinasentence.com/oleaginous-in-a-sentence/][Oleaginous]]

  =oily, greasy=

  - From the excess shine and acne on her face, you can tell Olivia has an oleaginous skin problem.
  - Even when you mix an oleaginous substance and water together they still separate.
  - I had to dab my pizza with a napkin because it is so oleaginous.
  - As an oleaginous land, lots of money was coming in from oil sales.



* [[https://wordsinasentence.com/olfactory-in-a-sentence/][Olfactory]]

  =pertaining to the smell sense=

  - Because my brother has straws in his nose, his olfactory sense is not picking up the odors coming from the kitchen.
  - The hound dog used his olfactory sense to locate the missing girl.
  - Even though Jason is blind, he can easily find the kitchen using his strong olfactory receptors.
  - My cold is interfering with my main olfactory nerve so I cannot smell anything.
  - When most people think of the olfactory organ in humans, they typically think of the nose.
  - The olfactory receptors translate information to the brain so it can recognize the source of the odor.
  - Because my olfactory stimuli are easily irritated by pollen, I usually sneeze a lot in the spring.



* [[https://wordsinasentence.com/omnipresent-in-a-sentence/][Omnipresent]]

  =able to be everywhere at one time=

  - The soccer coach described his star player as being omnipresent, all over the field at once.
  - Because my mother loves carrots, she adds them as an omnipresent ingredient in every dish she makes.
  - Our omnipresent mayor never misses a chance to get in front of a camera.
  - When I went to college and left my omnipresent parents behind, I really began to enjoy my freedom.



* [[https://wordsinasentence.com/omniscient-in-a-sentence/][Omniscient]]

  =having total knowledge; all-knowing=

  - Melanie felt that it was important to know what every character was thinking, so she wrote her novel from an omniscient point of view.
  - He thinks he knows what is best for everybody, but as far I know he is not omniscient.
  - Without an omniscient narrator, the reader is intentionally left in the dark about the motivation of the antagonist until the very end of the story.
  - If the house had a brain, it would be omniscient because of all the cameras and communication devices in all the rooms.
  - Unless you are omniscient, you can’t possibly predict what type of technology we’ll be relying on in twenty years.
  - She claims to have psychic abilities, but she never said she was omniscient.
  - If world leaders had the capability to be omniscient, there would probably be an end to all war.



