ruby/O.html

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/occult-in-a-sentence/">Occult</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>relating to magical or supernatural abilities</code>
</p>

<ul class="org-ul">
<li>The occult show about a group of teenage witches living together is one of the highest rated shows on television.
</li>
<li>Although the pretend psychic has no occult powers, she leads people to believe she does.
</li>
<li>It is said that on Halloween night all the occult creatures walk the Earth.
</li>
<li>Can you believe Sarah is going to take the occult arts class so she can learn how to torture her ex-husband from a distance?
</li>
<li>Surprisingly, the nonfiction author is writing a novel that centers on an old man who engages in occult science to bring his wife back from the dead.
</li>
<li>As soon as I learned the occult ritual involved killing a rabbit, I knew I wanted no part of the family’s annual tradition.
</li>
<li>Mary’s occult shop contains a variety of spell books, herbs, and magical cards and crystals.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/ocular-in-a-sentence/">Ocular</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>associated with vision or eyesight</code>
</p>

<ul class="org-ul">
<li>Ocular pain forced me to call my eye doctor.
</li>
<li>When my teenaged daughter learned she needed an ocular device to improve her vision, she immediately requested contact lenses.
</li>
<li>Scientists wear goggles in the lab to prevent ocular injury.
</li>
<li>If the ocular disease remains untreated, it could cause blindness.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/ode-in-a-sentence/">Ode</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>a poem that praises or celebrates something</code>
</p>

<ul class="org-ul">
<li>Phil created lyrics for the choir that were an ode to his alma mater.
</li>
<li>Mel recited a beautiful ode under his sister’s wedding canopy while softly strumming on his guitar.
</li>
<li>The poet spent years writing an ode that takes many hours to recite.
</li>
<li>I wrote an ode to the United States and asked Jeff to recite it at the parade.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/odium-in-a-sentence/">Odium</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>loathing for a thing or person deemed to be despicable</code>
</p>

<ul class="org-ul">
<li>The public’s odium towards the congressman is an advantage for the candidate opposing him in the election.
</li>
<li>After getting out of prison, the child molester still had to deal with odium from his neighbors.
</li>
<li>The new abortion bill is sure to trigger odium from church leaders.
</li>
<li>Because of my odium for the politician’s views, I have no plans to vote for him.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/odoriferous-in-a-sentence/">Odoriferous</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>producing an unpleasant scent</code>
</p>

<ul class="org-ul">
<li>After eating six burritos, my brother turned the bathroom into an odoriferous chamber.
</li>
<li>The rotting corpse transformed the tiny house into an odoriferous dwelling.
</li>
<li>The pregnant woman became nauseated when she smelled the scent from the odoriferous fish market.
</li>
<li>The dog’s odoriferous gassiness made everyone leave the room.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/ogle-in-a-sentence/">Ogle</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>to look at in a suggestive manner</code>
</p>

<ul class="org-ul">
<li>Because the women feel the construction workers ogle them, they hate to walk by the unfinished building.
</li>
<li>The football players ogle the cheerleaders when they should be listening to their coach.
</li>
<li>While the nerdy guys ogle the pretty girls at the party, they are too shy to invite them to dance.
</li>
<li>The boys sneaked into their father’s room to ogle his adult magazines.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/ointment-in-a-sentence/">Ointment</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>a cream rubbed on the skin for medicinal purposes</code>
</p>

<ul class="org-ul">
<li>Antibiotic ointment was applied to the wound to keep bacteria at bay.
</li>
<li>The homeopathic physician assured the depressed woman that spreading the ointment allover her body would cure her.
</li>
<li>The oily ointment was great for the player’s sore knee but ruined his clothing.
</li>
<li>Squeezing the ointment out of the tube, the boy rubbed the gooey contents onto his scraped knee.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/oleaginous-in-a-sentence/">Oleaginous</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>oily, greasy</code>
</p>

<ul class="org-ul">
<li>From the excess shine and acne on her face, you can tell Olivia has an oleaginous skin problem.
</li>
<li>Even when you mix an oleaginous substance and water together they still separate.
</li>
<li>I had to dab my pizza with a napkin because it is so oleaginous.
</li>
<li>As an oleaginous land, lots of money was coming in from oil sales.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/olfactory-in-a-sentence/">Olfactory</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>pertaining to the smell sense</code>
</p>

<ul class="org-ul">
<li>Because my brother has straws in his nose, his olfactory sense is not picking up the odors coming from the kitchen.
</li>
<li>The hound dog used his olfactory sense to locate the missing girl.
</li>
<li>Even though Jason is blind, he can easily find the kitchen using his strong olfactory receptors.
</li>
<li>My cold is interfering with my main olfactory nerve so I cannot smell anything.
</li>
<li>When most people think of the olfactory organ in humans, they typically think of the nose.
</li>
<li>The olfactory receptors translate information to the brain so it can recognize the source of the odor.
</li>
<li>Because my olfactory stimuli are easily irritated by pollen, I usually sneeze a lot in the spring.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> <a href="https://wordsinasentence.com/omnipresent-in-a-sentence/">Omnipresent</a></h2>
<div class="outline-text-2" id="text-64">
<p>
<code>able to be everywhere at one time</code>
</p>

<ul class="org-ul">
<li>The soccer coach described his star player as being omnipresent, all over the field at once.
</li>
<li>Because my mother loves carrots, she adds them as an omnipresent ingredient in every dish she makes.
</li>
<li>Our omnipresent mayor never misses a chance to get in front of a camera.
</li>
<li>When I went to college and left my omnipresent parents behind, I really began to enjoy my freedom.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/omniscient-in-a-sentence/">Omniscient</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>having total knowledge; all-knowing</code>
</p>

<ul class="org-ul">
<li>Melanie felt that it was important to know what every character was thinking, so she wrote her novel from an omniscient point of view.
</li>
<li>He thinks he knows what is best for everybody, but as far I know he is not omniscient.
</li>
<li>Without an omniscient narrator, the reader is intentionally left in the dark about the motivation of the antagonist until the very end of the story.
</li>
<li>If the house had a brain, it would be omniscient because of all the cameras and communication devices in all the rooms.
</li>
<li>Unless you are omniscient, you can’t possibly predict what type of technology we’ll be relying on in twenty years.
</li>
<li>She claims to have psychic abilities, but she never said she was omniscient.
</li>
<li>If world leaders had the capability to be omniscient, there would probably be an end to all war.
</li>
</ul>
</div>
</div>
