ruby/O.org
* [[https://wordsinasentence.com/omnivorous-in-a-sentence/][Omnivorous]]

  =eating both plants and animals=

  - Because my rabbit only eats plants, it is not omnivorous.
  - Sheila is a strict vegetarian who would never become omnivorous by adding meat to her diet.
  - Although Rick is omnivorous, he does not eat a lot of vegetables.
  - The small animal is omnivorous and feasts upon both nuts and bugs.



* [[https://wordsinasentence.com/onset-in-a-sentence/][Onset]]

  =at the start of something=

  - Arguments plagued the adult children about what to do with the matriarch of the family due to her onset of dementia.
  - When Tyler’s voice cracked for the first time, his mother knew that this was the onset of puberty for her son.
  - Being overweight and continuing to eat fatty foods resulted in Martha’s doctor preparing her for the onset of diabetes.
  - Feeling strong contractions revealed to the pregnant woman that she was in the onset of labor.



* [[https://wordsinasentence.com/onslaught-in-a-sentence/][Onslaught]]

  =a fierce attack=

  - After the apartment fire, there was an onslaught of frustrated people displaced from their homes.
  - After they were told the school was closing, there was an onslaught of angry parents demanding answers.
  - An onslaught of paintball opponents ushered towards me.
  - The adulterer was prepared for an onslaught of negative attention.



* [[https://wordsinasentence.com/onus-in-a-sentence/][Onus]]

  =the responsibility for something=

  - It is the onus of the applicant to completely fill out the application materials.
  - As your mother, it is my onus to prepare you for a successful future.
  - The onus is on the pharmacist to make sure the medications are properly dispensed.
  - As a good teacher, I accept the onus for making sure my students learn something each day.
  - The ability to purchase movie tickets online has eliminated the onus of having to stand at the box office window.
  - Before the men became police officers, they had to swear to accept the onus for everyone in their communities.
  - It is the prosecuting attorney’s onus to prove the guilt of the defendant.



* [[https://wordsinasentence.com/ooze-in-a-sentence/][Ooze]]

  =to trickle or seep out slowly=

  - Ink seemed to ooze from the pen creating a small blue stain on my brand new pants.
  - If the man stabs the victim, blood will most likely ooze from the wound and down the victim’s body.
  - Slimy substances ooze from the sewer pipe into the yard confirming a leak.
  - The chocolate pudding mixture would ooze from inside of the cupcake when someone would bite into it.



* [[https://wordsinasentence.com/opine-in-a-sentence/][Opine]]

  =to give an opinion=

  - Rather than disagree with my husband in public, I waited until we got home to opine my thoughts on the subject.
  - Dentists opine flossing is essential for maintaining good dental health.
  - While one referee felt the kick was good, the other referee chose to opine a different outlook on the play.
  - Many religious groups opine cloning is an act that attempts to mimic God’s power.



* [[https://wordsinasentence.com/oracular-in-a-sentence/][Oracular]]

  =prophetic; predictive=

  - Oracular predictions proved to be true as the medium knew that Donald Trump would be elected president.
  - Gazing into her crystal ball, the clairvoyant uttered an oracular tale of what the woman’s life would be like.
  - The soothsayer’s oracular responses were trusted by the tribe since most of his prophecies had at least a hint of truth.
  - Pretending to offer oracular readings, the sham psychic lined her pockets with money from the gullible.



* [[https://wordsinasentence.com/orator-in-a-sentence/][Orator]]

  =one who excels at speaking to an audience=

  - Thad is a much-liked orator who keeps people fully engaged while he is speaking.
  - If you want to be a successful politician, you should strive to become a great orator so you can win votes with your words.
  - I left the room as soon as the racist orator started to spread his message of hate.
  - Because Heather is a gifted orator, she is often called upon to host events.
  - Katie was looking forward to hearing the guest orator speak in her economics class.
  - Because Rick is an excellent orator who can sway people with his speech, he is an amazing lawyer.
  - I realized Angie was a wonderful orator when I heard her deliver an amazing spoken word poem.



* [[https://wordsinasentence.com/ordain-in-a-sentence/][Ordain]]

  =to deliver a decree or confirm a person into a religious ministry=

  - If the church decides to ordain the convicted rapist as a deacon, many people will leave the congregation.
  - John knows the ministry will never ordain him as a priest because of his checkered past.
  - What made the fashion gods ordain floral prints as the must-have style of the year?
  - For the first time, our conservative church elders will ordain a woman as a minister.



* [[https://wordsinasentence.com/ordinance-in-a-sentence/][Ordinance]]

  =legislation or a decree=

  - The county ordinance prohibits smoking inside public establishments.
  - When the ordinance is passed, people will be fined for not keeping their front lawns neatly cut.
  - The ordinance abolished slavery in all villages ruled by the king.
  - When our city council passed an ordinance prohibiting Sunday alcohol sales, many citizens were upset about the restriction.



* [[https://wordsinasentence.com/ornate-in-a-sentence/][Ornate]]

  =extravagantly adorned or worded=

  - The uneducated man could not understand the ornate speech made by the Ivy League professor.
  - Because the wedding dress is ornate with pearls and diamonds, it is valued at nearly half a million dollars.
  - Every bedroom in the billionaire’s mansion is ornate with luxurious furnishings and classical works of art.
  - Since the engagement party is supposed to be a simple outdoor barbecue, we ask people to avoid dressing in an ornate manner.

