ruby/O.html



<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/omnivorous-in-a-sentence/">Omnivorous</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>eating both plants and animals</code>
</p>

<ul class="org-ul">
<li>Because my rabbit only eats plants, it is not omnivorous.
</li>
<li>Sheila is a strict vegetarian who would never become omnivorous by adding meat to her diet.
</li>
<li>Although Rick is omnivorous, he does not eat a lot of vegetables.
</li>
<li>The small animal is omnivorous and feasts upon both nuts and bugs.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/onset-in-a-sentence/">Onset</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>at the start of something</code>
</p>

<ul class="org-ul">
<li>Arguments plagued the adult children about what to do with the matriarch of the family due to her onset of dementia.
</li>
<li>When Tyler’s voice cracked for the first time, his mother knew that this was the onset of puberty for her son.
</li>
<li>Being overweight and continuing to eat fatty foods resulted in Martha’s doctor preparing her for the onset of diabetes.
</li>
<li>Feeling strong contractions revealed to the pregnant woman that she was in the onset of labor.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/onslaught-in-a-sentence/">Onslaught</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>a fierce attack</code>
</p>

<ul class="org-ul">
<li>After the apartment fire, there was an onslaught of frustrated people displaced from their homes.
</li>
<li>After they were told the school was closing, there was an onslaught of angry parents demanding answers.
</li>
<li>An onslaught of paintball opponents ushered towards me.
</li>
<li>The adulterer was prepared for an onslaught of negative attention.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/onus-in-a-sentence/">Onus</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>the responsibility for something</code>
</p>

<ul class="org-ul">
<li>It is the onus of the applicant to completely fill out the application materials.
</li>
<li>As your mother, it is my onus to prepare you for a successful future.
</li>
<li>The onus is on the pharmacist to make sure the medications are properly dispensed.
</li>
<li>As a good teacher, I accept the onus for making sure my students learn something each day.
</li>
<li>The ability to purchase movie tickets online has eliminated the onus of having to stand at the box office window.
</li>
<li>Before the men became police officers, they had to swear to accept the onus for everyone in their communities.
</li>
<li>It is the prosecuting attorney’s onus to prove the guilt of the defendant.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/ooze-in-a-sentence/">Ooze</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>to trickle or seep out slowly</code>
</p>

<ul class="org-ul">
<li>Ink seemed to ooze from the pen creating a small blue stain on my brand new pants.
</li>
<li>If the man stabs the victim, blood will most likely ooze from the wound and down the victim’s body.
</li>
<li>Slimy substances ooze from the sewer pipe into the yard confirming a leak.
</li>
<li>The chocolate pudding mixture would ooze from inside of the cupcake when someone would bite into it.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/opine-in-a-sentence/">Opine</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>to give an opinion</code>
</p>

<ul class="org-ul">
<li>Rather than disagree with my husband in public, I waited until we got home to opine my thoughts on the subject.
</li>
<li>Dentists opine flossing is essential for maintaining good dental health.
</li>
<li>While one referee felt the kick was good, the other referee chose to opine a different outlook on the play.
</li>
<li>Many religious groups opine cloning is an act that attempts to mimic God’s power.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> <a href="https://wordsinasentence.com/oracular-in-a-sentence/">Oracular</a></h2>
<div class="outline-text-2" id="text-72">
<p>
<code>prophetic; predictive</code>
</p>

<ul class="org-ul">
<li>Oracular predictions proved to be true as the medium knew that Donald Trump would be elected president.
</li>
<li>Gazing into her crystal ball, the clairvoyant uttered an oracular tale of what the woman’s life would be like.
</li>
<li>The soothsayer’s oracular responses were trusted by the tribe since most of his prophecies had at least a hint of truth.
</li>
<li>Pretending to offer oracular readings, the sham psychic lined her pockets with money from the gullible.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-73" class="outline-2">
<h2 id="sec-73"><span class="section-number-2">73</span> <a href="https://wordsinasentence.com/orator-in-a-sentence/">Orator</a></h2>
<div class="outline-text-2" id="text-73">
<p>
<code>one who excels at speaking to an audience</code>
</p>

<ul class="org-ul">
<li>Thad is a much-liked orator who keeps people fully engaged while he is speaking.
</li>
<li>If you want to be a successful politician, you should strive to become a great orator so you can win votes with your words.
</li>
<li>I left the room as soon as the racist orator started to spread his message of hate.
</li>
<li>Because Heather is a gifted orator, she is often called upon to host events.
</li>
<li>Katie was looking forward to hearing the guest orator speak in her economics class.
</li>
<li>Because Rick is an excellent orator who can sway people with his speech, he is an amazing lawyer.
</li>
<li>I realized Angie was a wonderful orator when I heard her deliver an amazing spoken word poem.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/ordain-in-a-sentence/">Ordain</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>to deliver a decree or confirm a person into a religious ministry</code>
</p>

<ul class="org-ul">
<li>If the church decides to ordain the convicted rapist as a deacon, many people will leave the congregation.
</li>
<li>John knows the ministry will never ordain him as a priest because of his checkered past.
</li>
<li>What made the fashion gods ordain floral prints as the must-have style of the year?
</li>
<li>For the first time, our conservative church elders will ordain a woman as a minister.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/ordinance-in-a-sentence/">Ordinance</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>legislation or a decree</code>
</p>

<ul class="org-ul">
<li>The county ordinance prohibits smoking inside public establishments.
</li>
<li>When the ordinance is passed, people will be fined for not keeping their front lawns neatly cut.
</li>
<li>The ordinance abolished slavery in all villages ruled by the king.
</li>
<li>When our city council passed an ordinance prohibiting Sunday alcohol sales, many citizens were upset about the restriction.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> <a href="https://wordsinasentence.com/ornate-in-a-sentence/">Ornate</a></h2>
<div class="outline-text-2" id="text-76">
<p>
<code>extravagantly adorned or worded</code>
</p>

<ul class="org-ul">
<li>The uneducated man could not understand the ornate speech made by the Ivy League professor.
</li>
<li>Because the wedding dress is ornate with pearls and diamonds, it is valued at nearly half a million dollars.
</li>
<li>Every bedroom in the billionaire’s mansion is ornate with luxurious furnishings and classical works of art.
</li>
<li>Since the engagement party is supposed to be a simple outdoor barbecue, we ask people to avoid dressing in an ornate manner.
</li>
</ul>
</div>
</div>
