ruby/O.org
* [[https://wordsinasentence.com/ornery-in-a-sentence/][Ornery]]

  =crotchety, rude, or mean=

  - The ornery old man is always treating everyone around him very rudely, which is probably why nobody likes him.
  - I can be very ornery if I don’t get my coffee in the morning, being mean to everyone that tries to bother me.
  - If there is one thing that will make my mother very ornery, it is my father leaving the toilet seat up, which makes her yell a lot.
  - An ornery person usually treats everyone around them poorly, either being mean or just cold in general.



* [[https://wordsinasentence.com/orotund-in-a-sentence/][Orotund]]

  =haughty in tone or style=

  - The millionaire’s orotund manner made him come across as arrogant.
  - When the president visits with the automotive workers, he tries to be one of the guys by avoiding the use of orotund dialogue.
  - The blogger does not write in an orotund style because he wants his articles to appeal to the general public.
  - Because the politician made an orotund speech about his wealthy upbringing, he lost favor with the middle class voters.



* [[https://wordsinasentence.com/oscillate-in-a-sentence/][Oscillate]]

  =to swing back and forth=

  - Though you cannot see it, sound waves constantly oscillate as they travel through the air.
  - The pendulum oscillated side to side, making it difficult for the man to focus on anything but the clock.
  - To aide with his hypnosis, the hypnotists oscillated a pocket watch in front of his patient.
  - As a demonstration, the science teacher placed a string on top of a speaker so his students could watch it oscillate.
  - As a politician, it is expected that he will sometimes oscillate on his policy, changing his stance as new evidence is presented.
  - Watching the readings from the earthquake, the scientist could easily see the intensity oscillate.
  - The musician watched the metronome oscillate back and forth, using it to keep himself from playing too quickly.



* [[https://wordsinasentence.com/osmosis-in-a-sentence/][Osmosis]]

  =the capability to comprehend things without exertion=

  - Because Gail never studies but always does well on exams, she must learn through osmosis.
  - It seems as though Helen absorbs information through osmosis because she understands everything after hearing it only once.
  - Since Matt has never taken piano lessons but plays like a professional pianist, everyone assumes he acquired the skill through osmosis.
  - Ann must have gained her knowledge by way of osmosis because she skipped school almost every day.



* [[https://wordsinasentence.com/ostensible-in-a-sentence/][Ostensible]]

  =appearing as such but not necessarily so=

  - Your ostensible prank has done a lot of damage, and now you must face the consequences of your actions.
  - While Jerry is the ostensible author of this amendment, there is some question of who actually deserves credit for the idea.
  - While the ostensible destination of our trip sounded appealing, I was dreading the long drive it would take to get there.
  - In this neighborhood, George is the ostensible authority on native plants for landscaping.
  - The ostensible cause of the breakdown seems to be that someone has tampered with the gas tank.
  - As the ostensible Alpha male, Sandulf led the pack through the mountains in search of food and water.
  - Gary’s ostensible purpose for calling his mother was to see how she was doing, but she soon figured out that he needed money again.




* [[https://wordsinasentence.com/otiose-in-a-sentence/][Otiose]]

  =not useful=

  - Attempting to get Beth to change her mind is otiose because she is totally inflexible.
  - It’s otiose to spend so much on catering when few people have responded to the invitation.
  - While reading Hank’s column, the editor deleted the second paragraph because he found it otiose and unnecessary.
  - It is otiose to put a tiny bandage on a wide open wound.



* [[https://wordsinasentence.com/outfox-in-a-sentence/][Outfox]]

  =to con or trick someone using keen and smart ways=

  - Using his wit and finesse, the veteran defense attorney was able to outfox any lead witness into saying incriminating information about themselves.
  - Usually politicians spend their careers trying to outfox their opponents with colorful stories, false promises and believable lies to get the people to vote for them.
  - Timothy began to outfox his parents by coming home right before curfew and then escaping back out his window to rejoin his friends.
  - Scammers will intentionally target the elderly in order to outfox them by having them send money to a fictional charity.



* [[https://wordsinasentence.com/outlandish-in-a-sentence/][Outlandish]]

  =very unusual=

  - Jim’s outlandish plan to get money involves robbing a bank with water guns.
  - Can you believe the outlandish rapper wants to run for president?
  - When the boy was asked about his report, he created an outlandish story about aliens stealing his work.
  - The male clown looked outlandish in the party dress.



* [[https://wordsinasentence.com/outset-in-a-sentence/][Outset]]

  =at the start of something=

  - Every character at the outset of the book was fully developed so that the reader knew everything about the characters prior to the plot.
  - At the outset of the training process, the safety rules were explicitly stated so that no one would get hurt.
  - Since the doctor discovered the cancer during the outset of its stage, the person would fully recover.
  - Tasks were distributed during the outset of the project so that everyone knew exactly what they had to do.




* [[https://wordsinasentence.com/overhaul-in-a-sentence/][Overhaul]]

  =to assess and replace with something better or newer=

  - After the Bolsheviks assassinated the Romanovs, they began an overhaul of the Russian government and completely rewrote the laws.
  - The baker spent several thousand dollars on the complete overhaul of all of his outdated kitchen appliances and replaced them with the latest models.
  - When Dalia broke up with her boyfriend, she did a massive overhaul of their entire apartment and threw away everything that reminded her of her ex.
  - After more than half of her class failed their exam, the teacher reevaluated her teaching methods and started a complete overhaul of every worksheet and assignment.



