ruby/O.html

<div id="outline-container-sec-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> <a href="https://wordsinasentence.com/ornery-in-a-sentence/">Ornery</a></h2>
<div class="outline-text-2" id="text-77">
<p>
<code>crotchety, rude, or mean</code>
</p>

<ul class="org-ul">
<li>The ornery old man is always treating everyone around him very rudely, which is probably why nobody likes him.
</li>
<li>I can be very ornery if I don’t get my coffee in the morning, being mean to everyone that tries to bother me.
</li>
<li>If there is one thing that will make my mother very ornery, it is my father leaving the toilet seat up, which makes her yell a lot.
</li>
<li>An ornery person usually treats everyone around them poorly, either being mean or just cold in general.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> <a href="https://wordsinasentence.com/orotund-in-a-sentence/">Orotund</a></h2>
<div class="outline-text-2" id="text-78">
<p>
<code>haughty in tone or style</code>
</p>

<ul class="org-ul">
<li>The millionaire’s orotund manner made him come across as arrogant.
</li>
<li>When the president visits with the automotive workers, he tries to be one of the guys by avoiding the use of orotund dialogue.
</li>
<li>The blogger does not write in an orotund style because he wants his articles to appeal to the general public.
</li>
<li>Because the politician made an orotund speech about his wealthy upbringing, he lost favor with the middle class voters.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> <a href="https://wordsinasentence.com/oscillate-in-a-sentence/">Oscillate</a></h2>
<div class="outline-text-2" id="text-79">
<p>
<code>to swing back and forth</code>
</p>

<ul class="org-ul">
<li>Though you cannot see it, sound waves constantly oscillate as they travel through the air.
</li>
<li>The pendulum oscillated side to side, making it difficult for the man to focus on anything but the clock.
</li>
<li>To aide with his hypnosis, the hypnotists oscillated a pocket watch in front of his patient.
</li>
<li>As a demonstration, the science teacher placed a string on top of a speaker so his students could watch it oscillate.
</li>
<li>As a politician, it is expected that he will sometimes oscillate on his policy, changing his stance as new evidence is presented.
</li>
<li>Watching the readings from the earthquake, the scientist could easily see the intensity oscillate.
</li>
<li>The musician watched the metronome oscillate back and forth, using it to keep himself from playing too quickly.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> <a href="https://wordsinasentence.com/osmosis-in-a-sentence/">Osmosis</a></h2>
<div class="outline-text-2" id="text-80">
<p>
<code>the capability to comprehend things without exertion</code>
</p>

<ul class="org-ul">
<li>Because Gail never studies but always does well on exams, she must learn through osmosis.
</li>
<li>It seems as though Helen absorbs information through osmosis because she understands everything after hearing it only once.
</li>
<li>Since Matt has never taken piano lessons but plays like a professional pianist, everyone assumes he acquired the skill through osmosis.
</li>
<li>Ann must have gained her knowledge by way of osmosis because she skipped school almost every day.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/ostensible-in-a-sentence/">Ostensible</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>appearing as such but not necessarily so</code>
</p>

<ul class="org-ul">
<li>Your ostensible prank has done a lot of damage, and now you must face the consequences of your actions.
</li>
<li>While Jerry is the ostensible author of this amendment, there is some question of who actually deserves credit for the idea.
</li>
<li>While the ostensible destination of our trip sounded appealing, I was dreading the long drive it would take to get there.
</li>
<li>In this neighborhood, George is the ostensible authority on native plants for landscaping.
</li>
<li>The ostensible cause of the breakdown seems to be that someone has tampered with the gas tank.
</li>
<li>As the ostensible Alpha male, Sandulf led the pack through the mountains in search of food and water.
</li>
<li>Gary’s ostensible purpose for calling his mother was to see how she was doing, but she soon figured out that he needed money again.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/otiose-in-a-sentence/">Otiose</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>not useful</code>
</p>

<ul class="org-ul">
<li>Attempting to get Beth to change her mind is otiose because she is totally inflexible.
</li>
<li>It’s otiose to spend so much on catering when few people have responded to the invitation.
</li>
<li>While reading Hank’s column, the editor deleted the second paragraph because he found it otiose and unnecessary.
</li>
<li>It is otiose to put a tiny bandage on a wide open wound.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/outfox-in-a-sentence/">Outfox</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>to con or trick someone using keen and smart ways</code>
</p>

<ul class="org-ul">
<li>Using his wit and finesse, the veteran defense attorney was able to outfox any lead witness into saying incriminating information about themselves.
</li>
<li>Usually politicians spend their careers trying to outfox their opponents with colorful stories, false promises and believable lies to get the people to vote for them.
</li>
<li>Timothy began to outfox his parents by coming home right before curfew and then escaping back out his window to rejoin his friends.
</li>
<li>Scammers will intentionally target the elderly in order to outfox them by having them send money to a fictional charity.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-84" class="outline-2">
<h2 id="sec-84"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/outlandish-in-a-sentence/">Outlandish</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>very unusual</code>
</p>

<ul class="org-ul">
<li>Jim’s outlandish plan to get money involves robbing a bank with water guns.
</li>
<li>Can you believe the outlandish rapper wants to run for president?
</li>
<li>When the boy was asked about his report, he created an outlandish story about aliens stealing his work.
</li>
<li>The male clown looked outlandish in the party dress.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-85" class="outline-2">
<h2 id="sec-85"><span class="section-number-2">85</span> <a href="https://wordsinasentence.com/outset-in-a-sentence/">Outset</a></h2>
<div class="outline-text-2" id="text-85">
<p>
<code>at the start of something</code>
</p>

<ul class="org-ul">
<li>Every character at the outset of the book was fully developed so that the reader knew everything about the characters prior to the plot.
</li>
<li>At the outset of the training process, the safety rules were explicitly stated so that no one would get hurt.
</li>
<li>Since the doctor discovered the cancer during the outset of its stage, the person would fully recover.
</li>
<li>Tasks were distributed during the outset of the project so that everyone knew exactly what they had to do.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-86" class="outline-2">
<h2 id="sec-86"><span class="section-number-2">86</span> <a href="https://wordsinasentence.com/overhaul-in-a-sentence/">Overhaul</a></h2>
<div class="outline-text-2" id="text-86">
<p>
<code>to assess and replace with something better or newer</code>
</p>

<ul class="org-ul">
<li>After the Bolsheviks assassinated the Romanovs, they began an overhaul of the Russian government and completely rewrote the laws.
</li>
<li>The baker spent several thousand dollars on the complete overhaul of all of his outdated kitchen appliances and replaced them with the latest models.
</li>
<li>When Dalia broke up with her boyfriend, she did a massive overhaul of their entire apartment and threw away everything that reminded her of her ex.
</li>
<li>After more than half of her class failed their exam, the teacher reevaluated her teaching methods and started a complete overhaul of every worksheet and assignment.
</li>
</ul>
</div>
</div>
