ruby/O.org
* [[https://wordsinasentence.com/overture-in-a-sentence/][Overture]]

  =a piece of music played at the beginning of an opera or musical play=

  - When he heard the overture begin to play, the actor immediately became nervous.
  - The conductor led the band through the overture of The Wizard of Oz.
  - The music class was given the honor of creating an overture for the commencement ceremony.
  - Wanting to add a new song to their repertoire, the violinist studied an overture.



* [[https://wordsinasentence.com/overweening-in-a-sentence/][Overweening]]

  =arrogant; conceited=

  - Ever since Jim won the contest, he has been overweening and acting as though he is the smartest kid on the planet.
  - The overweening professor laughed at his students when they asked what he felt were stupid questions.
  - Because Al was overweening about his intelligence, he thought he could pass the test without studying.
  - Bragging about your numerous victories makes you seem a bit overweening.



* [[https://wordsinasentence.com/oxidize-in-a-sentence/][Oxidize]]

  =to merge with oxygen such as in the process of rusting or burning=

  - If you leave your bike in the rain, it will oxidize and begin to rust.
  - Even if the silver tray starts to oxidize, you can use polish to cover up the blemish.
  - Untainted potassium will oxidize rapidly when it is exposed to air.
  - The metal roof will oxidize after a few years and turn an unpleasant shade of green.






#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>