ruby/O.html



<div id="outline-container-sec-87" class="outline-2">
<h2 id="sec-87"><span class="section-number-2">87</span> <a href="https://wordsinasentence.com/overture-in-a-sentence/">Overture</a></h2>
<div class="outline-text-2" id="text-87">
<p>
<code>a piece of music played at the beginning of an opera or musical play</code>
</p>

<ul class="org-ul">
<li>When he heard the overture begin to play, the actor immediately became nervous.
</li>
<li>The conductor led the band through the overture of The Wizard of Oz.
</li>
<li>The music class was given the honor of creating an overture for the commencement ceremony.
</li>
<li>Wanting to add a new song to their repertoire, the violinist studied an overture.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-88" class="outline-2">
<h2 id="sec-88"><span class="section-number-2">88</span> <a href="https://wordsinasentence.com/overweening-in-a-sentence/">Overweening</a></h2>
<div class="outline-text-2" id="text-88">
<p>
<code>arrogant; conceited</code>
</p>

<ul class="org-ul">
<li>Ever since Jim won the contest, he has been overweening and acting as though he is the smartest kid on the planet.
</li>
<li>The overweening professor laughed at his students when they asked what he felt were stupid questions.
</li>
<li>Because Al was overweening about his intelligence, he thought he could pass the test without studying.
</li>
<li>Bragging about your numerous victories makes you seem a bit overweening.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-89" class="outline-2">
<h2 id="sec-89"><span class="section-number-2">89</span> <a href="https://wordsinasentence.com/oxidize-in-a-sentence/">Oxidize</a></h2>
<div class="outline-text-2" id="text-89">
<p>
<code>to merge with oxygen such as in the process of rusting or burning</code>
</p>

<ul class="org-ul">
<li>If you leave your bike in the rain, it will oxidize and begin to rust.
</li>
<li>Even if the silver tray starts to oxidize, you can use polish to cover up the blemish.
</li>
<li>Untainted potassium will oxidize rapidly when it is exposed to air.
</li>
<li>The metal roof will oxidize after a few years and turn an unpleasant shade of green.
</li>
</ul>






<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>